app/controllers/comments_controller.rb

	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(params[:comment].permit(:user_info, :data))
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("user_info", "data", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_info", "svd"], ["data", "vdsvds"], ["post_id", 3], ["created_at", "2020-05-30 21:04:39.851324"], ["updated_at", "2020-05-30 21:04:39.851324"]]