app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "user title"], ["body", "test body\r\n"], ["created_at", "2020-05-30 11:55:55.370547"], ["updated_at", "2020-05-30 11:55:55.370547"], ["user_id", 1]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id


    respond_to do |format|
      if @post.save

UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "test\r\n\r\n"], ["updated_at", "2020-05-30 13:08:44.183862"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @post.user_id == current_user.id
        if @post.update(post_params)